data/Section 5/5.2/Client/VM3_Instance1/rep3/output_C2_T1_W64_K6_R3.log
[RUN #1] Preparing benchmark client...
[RUN #1] Launching threads now...
[RUN #1 100%,  90 secs]  0 threads:       41991 ops,     460 (avg:     466) ops/sec, 1.64MB/sec (avg: 1.66MB/sec),  4.33 (avg:  4.27) msec latency

1         Threads
2         Connections per thread
90        Seconds


ALL STATS
========================================================================
Type        Ops/sec     Hits/sec   Misses/sec      Latency       KB/sec
------------------------------------------------------------------------
Sets         233.28          ---          ---      4.19900       242.25
Gets         233.27      1399.61         0.00      4.34200      1456.27
Waits          0.00          ---          ---      0.00000          ---
Totals       466.55      1399.61         0.00      4.27000      1698.52


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET       1.500         0.01
SET       1.600         0.02
SET       1.700         0.20
SET       1.800         0.95
SET       1.900         2.68
SET       2.000         5.59
SET       2.100         9.61
SET       2.200        14.00
SET       2.300        18.64
SET       2.400        23.32
SET       2.500        27.77
SET       2.600        31.38
SET       2.700        34.98
SET       2.800        38.39
SET       2.900        41.08
SET       3.000        43.73
SET       3.100        45.90
SET       3.200        47.93
SET       3.300        49.74
SET       3.400        51.50
SET       3.500        52.99
SET       3.600        54.40
SET       3.700        55.78
SET       3.800        57.06
SET       3.900        58.33
SET       4.000        59.61
SET       4.100        60.95
SET       4.200        62.10
SET       4.300        63.23
SET       4.400        64.35
SET       4.500        65.53
SET       4.600        66.70
SET       4.700        68.00
SET       4.800        69.17
SET       4.900        70.44
SET       5.000        71.72
SET       5.100        72.83
SET       5.200        74.17
SET       5.300        75.32
SET       5.400        76.54
SET       5.500        77.82
SET       5.600        79.00
SET       5.700        80.07
SET       5.800        81.32
SET       5.900        82.48
SET       6.000        83.56
SET       6.100        84.61
SET       6.200        85.61
SET       6.300        86.45
SET       6.400        87.47
SET       6.500        88.38
SET       6.600        89.17
SET       6.700        89.96
SET       6.800        90.54
SET       6.900        91.12
SET       7.000        91.64
SET       7.100        92.09
SET       7.200        92.52
SET       7.300        92.96
SET       7.400        93.24
SET       7.500        93.54
SET       7.600        93.87
SET       7.700        94.08
SET       7.800        94.28
SET       7.900        94.50
SET       8.000        94.73
SET       8.100        94.93
SET       8.200        95.15
SET       8.300        95.33
SET       8.400        95.56
SET       8.500        95.69
SET       8.600        95.89
SET       8.700        96.03
SET       8.800        96.12
SET       8.900        96.28
SET       9.000        96.39
SET       9.100        96.55
SET       9.200        96.65
SET       9.300        96.79
SET       9.400        96.93
SET       9.500        97.09
SET       9.600        97.17
SET       9.700        97.25
SET       9.800        97.36
SET       9.900        97.44
SET      10.000        97.90
SET      11.000        98.41
SET      12.000        98.84
SET      13.000        99.08
SET      14.000        99.24
SET      15.000        99.36
SET      16.000        99.48
SET      17.000        99.56
SET      18.000        99.68
SET      19.000        99.72
SET      20.000        99.79
SET      21.000        99.81
SET      22.000        99.82
SET      23.000        99.84
SET      27.000        99.86
SET      28.000        99.87
SET      29.000        99.88
SET      30.000        99.89
SET      32.000        99.90
SET      34.000        99.90
SET      35.000        99.91
SET      36.000        99.92
SET      37.000        99.95
SET      38.000        99.96
SET      39.000        99.96
SET      40.000        99.97
SET      42.000        99.97
SET      44.000        99.98
SET      50.000        99.98
SET      63.000        99.99
SET      71.000       100.00
SET     150.000       100.00
---
GET       1.800         0.04
GET       1.900         0.26
GET       2.000         1.23
GET       2.100         3.34
GET       2.200         6.17
GET       2.300         9.94
GET       2.400        14.30
GET       2.500        19.11
GET       2.600        23.97
GET       2.700        28.88
GET       2.800        33.26
GET       2.900        36.82
GET       3.000        40.34
GET       3.100        43.54
GET       3.200        46.30
GET       3.300        48.68
GET       3.400        50.68
GET       3.500        52.41
GET       3.600        54.00
GET       3.700        55.45
GET       3.800        56.88
GET       3.900        58.29
GET       4.000        59.43
GET       4.100        60.60
GET       4.200        61.76
GET       4.300        62.93
GET       4.400        64.09
GET       4.500        65.07
GET       4.600        66.16
GET       4.700        67.28
GET       4.800        68.26
GET       4.900        69.48
GET       5.000        70.63
GET       5.100        71.83
GET       5.200        73.02
GET       5.300        74.25
GET       5.400        75.48
GET       5.500        76.67
GET       5.600        77.89
GET       5.700        79.19
GET       5.800        80.55
GET       5.900        81.82
GET       6.000        83.08
GET       6.100        84.26
GET       6.200        85.44
GET       6.300        86.49
GET       6.400        87.50
GET       6.500        88.45
GET       6.600        89.28
GET       6.700        90.09
GET       6.800        90.88
GET       6.900        91.48
GET       7.000        92.10
GET       7.100        92.66
GET       7.200        93.17
GET       7.300        93.60
GET       7.400        93.90
GET       7.500        94.26
GET       7.600        94.59
GET       7.700        94.84
GET       7.800        95.05
GET       7.900        95.27
GET       8.000        95.51
GET       8.100        95.71
GET       8.200        95.86
GET       8.300        96.04
GET       8.400        96.20
GET       8.500        96.36
GET       8.600        96.47
GET       8.700        96.58
GET       8.800        96.68
GET       8.900        96.83
GET       9.000        96.97
GET       9.100        97.09
GET       9.200        97.22
GET       9.300        97.32
GET       9.400        97.44
GET       9.500        97.54
GET       9.600        97.64
GET       9.700        97.73
GET       9.800        97.82
GET       9.900        97.90
GET      10.000        98.27
GET      11.000        98.75
GET      12.000        99.02
GET      13.000        99.20
GET      14.000        99.30
GET      15.000        99.43
GET      16.000        99.49
GET      17.000        99.56
GET      18.000        99.62
GET      19.000        99.68
GET      20.000        99.71
GET      21.000        99.74
GET      22.000        99.76
GET      23.000        99.79
GET      25.000        99.80
GET      27.000        99.81
GET      28.000        99.82
GET      29.000        99.83
GET      30.000        99.84
GET      33.000        99.85
GET      34.000        99.85
GET      35.000        99.87
GET      36.000        99.88
GET      37.000        99.89
GET      39.000        99.90
GET      40.000        99.90
GET      42.000        99.92
GET      46.000        99.92
GET      49.000        99.93
GET      50.000        99.93
GET      66.000        99.94
GET      68.000        99.94
GET      70.000        99.95
GET      88.000        99.95
GET      92.000        99.96
GET      93.000        99.97
GET      95.000        99.98
GET     120.000        99.98
GET     150.000        99.99
GET     160.000        99.99
GET     450.000       100.00
---